#Использовать v8runner

#Область Переменные

//Компаненты формы
Перем Ф;
Перем Кнопка1;
Перем Кнопка2;
Перем Кнопка3;
Перем Кнопка4;
Перем Кнопка5;
Перем Кнопка6;
Перем Кнопка7;
Перем Надпись1;
Перем Надпись2;
Перем Надпись3;
Перем Надпись4;
Перем Надпись5;
Перем ПолеВвода1;
Перем ПолеВвода2;
Перем ПолеВвода3;
Перем ПолеВвода4;
Перем ПолеВвода5;
Перем Флажок1;
Перем ДиалогВыбораКаталога1;
Перем Форма_1;

//Переменные программы
Перем путьАпач;
#КонецОбласти

Функция НайтиАпач() Экспорт

    //Находим полной путь первой папки в каталоге server (по алфавиту это всегда Apache24)
	РабочийКаталог=".\";
	Каталоги = НайтиФайлы(РабочийКаталог, "*.*", Ложь);
	Для Каждого НайденныйФайл Из Каталоги Цикл
		Если НайденныйФайл.ЭтоКаталог() Тогда
            break;
		КонецЕсли;
	КонецЦикла;
    путьАпач = """"+НайденныйФайл.ПолноеИмя+"""";

    //Задаём в файле httpd.conf путь апача
    Команда = Новый Команда; 
    Команда.УстановитьКоманду("powershell");
    пн="(Get-Content .\Apache24\conf\httpd.conf) -replace 'Define SRVROOT ', "+"\""Define SRVROOT "+путьАпач+"`n#\"" | Out-File -encoding ASCII .\Apache24\conf\httpd.conf";
    Команда.ДобавитьПараметр("-Command """+пн+"""");
    КодВозврата = Команда.Исполнить();
    Сообщить(Команда.ПолучитьВывод());

    Команда2 = Новый Команда;
    Команда2.УстановитьКоманду("powershell");
    пн="(Get-Content .\Apache24\conf\httpd.conf) -replace 'Define SRVROOT ', 'Define SRVROOT """"'  | Out-File -encoding ASCII .\Apache24\conf\httpd.conf";
    Команда2.ДобавитьПараметр("-Command """+пн+"""");
    КодВозврата = Команда2.Исполнить();
    Сообщить(Команда2.ПолучитьВывод());

    Команда3 = Новый Команда;
    Команда3.УстановитьКоманду("powershell");
    пн="(Get-Content .\Apache24\conf\httpd.conf) -replace 'Apache24', 'Apache24""""'  | Out-File -encoding ASCII .\Apache24\conf\httpd.conf";
    Команда3.ДобавитьПараметр("-Command """+пн+"""");
    КодВозврата = Команда3.Исполнить();
    Сообщить(Команда3.ПолучитьВывод());
    Сообщить("Апач успешно найден");
КонецФункции

Функция ХостВеба()Экспорт

    проверка =0 ;
    Если ПолеВвода4.Текст = "" Тогда
        Сообщить("Введите имя публикации");
        проверка = 1;
    КонецЕсли;
    Если ПолеВвода3.Текст = "" Тогда
        Сообщить("Выберите каталог публикации");
        проверка = 1;
    КонецЕсли;
    Если ПолеВвода2.Текст = "" Тогда
        Сообщить("Выберите каталог базы данных");
        проверка = 1;
    КонецЕсли;
    Если проверка = 0 Тогда
        //Запускаем апач
        ЗапуститьПриложение(".\httpd");

        //Находим путь апача
        РабочийКаталог=".\";
	    Каталоги = НайтиФайлы(РабочийКаталог, "*.*", Ложь);
	    Для Каждого НайденныйФайл Из Каталоги Цикл
	    	Если НайденныйФайл.ЭтоКаталог() Тогда
                break;
	    	КонецЕсли;
	    КонецЦикла;
        путьАпач = НайденныйФайл.ПолноеИмя;

        //Создаём батник с командой публикации и запуска
        Команда = Новый Команда;
        Команда.УстановитьКоманду("echo");
        Если Флажок1.Помечен Тогда
            Команда.ДобавитьПараметр(".\webinstt -publish -apache24 -wsdir");
        Иначе
            Команда.ДобавитьПараметр(".\webinst -publish -apache24 -wsdir");
        КонецЕсли;
        Команда.ДобавитьПараметр(ПолеВвода4.Текст);
        Команда.ДобавитьПараметр("-dir "+ПолеВвода3.Текст);
        Команда.ДобавитьПараметр("-connstr """+"File="+""""+ПолеВвода2.Текст+""""+";");
        Команда.ДобавитьПараметр(""""+" -confpath "+""""+путьАпач+"\conf\httpd.conf"+""""+" > ");
        Команда.ДобавитьПараметр(""""+".\+webStart.bat"+"""");
        Команда.Исполнить();
        Сообщить(Команда.ПолучитьВывод());

        Команда2 = Новый Команда;
        Команда2.УстановитьКоманду("echo");
        Команда2.ДобавитьПараметр("taskkill /F /IM httpd.exe >> .\+webStart.bat");
        Команда2.Исполнить();
        Сообщить(Команда2.ПолучитьВывод());

        Команда3 = Новый Команда;
        Команда3.УстановитьКоманду("echo");
        Команда3.ДобавитьПараметр("cd .\Apache24\bin >> .\+webStart.bat");
        Команда3.Исполнить();
        Сообщить(Команда3.ПолучитьВывод());

        Команда4 = Новый Команда;
        Команда4.УстановитьКоманду("echo");
        Команда4.ДобавитьПараметр("start http://localhost:"+ПолеВвода5.Текст+"/"+ПолеВвода4.Текст+" >> .\+webStart.bat");
        //Команда4.ДобавитьПараметр("start chrome.exe http://localhost:"+ПолеВвода5.Текст+"/"+ПолеВвода4.Текст+" >> .\+webStart.bat");
        //Команда4.ДобавитьПараметр("start firefox.exe http://localhost:"+ПолеВвода5.Текст+"/"+ПолеВвода4.Текст+" >> .\+webStart.bat");
        Команда4.Исполнить();
        Сообщить(Команда4.ПолучитьВывод());

        Команда3 = Новый Команда;
        Команда3.УстановитьКоманду("echo");
        Команда3.ДобавитьПараметр(".\httpd >> .\+webStart.bat");
        Команда3.Исполнить();
        Сообщить(Команда3.ПолучитьВывод());

        //Делаем из батника запуска веба exe
        Команда = Новый Команда;
        Команда.УстановитьСтрокуЗапуска(".\Bat_To_Exe_Converter.exe /bat .\+webStart.bat /exe .\+webStart.exe");
        Выв=Команда.Исполнить();
        Сообщить(Выв);
        Сообщить(Команда.ПолучитьВывод());

        //Запускаем exe веба
        ЗапуститьПриложение(".\+webStart.exe");
    КонецЕсли;
КонецФункции

функция СоздатьИБ() Экспорт

    проверка=1;

    //Если путь уже задан то используем его, если нет то пользователь сам выбирает
    Если ПолеВвода2.Текст="" Тогда
        Результат = ДиалогВыбораКаталога1.ПоказатьДиалог();
        Если Результат = Ф.РезультатДиалога.ОК  Тогда
            путь= ДиалогВыбораКаталога1.ВыбранныйПуть;
        Иначе
            Сообщить("Ошибка выбора каталога!");
            проверка=0;
        КонецЕсли;
    Иначе
        путь=ПолеВвода2.Текст;
    КонецЕсли;
    Если проверка=1 Тогда
        ПолеВвода2.Текст=путь;
        название=ПолеВвода1.текст;

        //Создаём новую иб
        Команда = Новый Команда;
        Если Флажок1.Помечен Тогда
            Команда.УстановитьСтрокуЗапуска(".\1cv8st.exe CREATEINFOBASE File="+путь+" /AddInList"+название);
        Иначе
            Команда.УстановитьСтрокуЗапуска(".\1cv8s.exe CREATEINFOBASE File="+путь+" /AddInList"+название);
        КонецЕсли;
        КодВозврата = Команда.Исполнить();
        Если КодВозврата = 0 Тогда
            Сообщить("База данных успешно создана");
        Иначе
            Сообщить("Ошибка при создании базы данных");
            Сообщить(Команда.ПолучитьВывод());
        КонецЕсли;
    КонецЕсли;
Конецфункции

Функция ВыбратьИБ() Экспорт

    //Выбор иб
    Результат = ДиалогВыбораКаталога1.ПоказатьДиалог();
    Если Результат = Ф.РезультатДиалога.ОК  Тогда
	    путь= ДиалогВыбораКаталога1.ВыбранныйПуть;
        Сообщить("База данных успешно выбрана");
    Иначе
        Сообщить("Ошибка выбора каталога!");
    КонецЕсли;
    ПолеВвода2.Текст=""""+путь+"""";
КонецФункции

Функция ИзменитьПорт() Экспорт

    Если ПолеВвода5.Текст = "" Тогда
        Сообщить("Введите данные в поле ввода порта");
    Иначе
        //Меняем в файле httpd.conf порт
        Команда = Новый Команда; 
        Команда.УстановитьКоманду("powershell");
        пн="(Get-Content .\Apache24\conf\httpd.conf) -replace 'Listen ', "+"\""Listen "+ПолеВвода5.Текст+"`n#\"" | Out-File -encoding ASCII .\Apache24\conf\httpd.conf";
        Команда.ДобавитьПараметр("-Command """+пн+"""");
        КодВозврата = Команда.Исполнить();
        Сообщить(Команда.ПолучитьВывод());
        Если КодВозврата = 0 Тогда
            Сообщить("Порт успешно изменён");
        Иначе
            Сообщить("Ошибка при попытке изменить порт");
        КонецЕсли;
    КонецЕсли;
КонецФункции

Функция ЗапуститьКонфигуратор() Экспорт

    //Запускаем конфигуратор
    Команда = Новый Команда;
    Если Флажок1.Помечен Тогда
        Команда.УстановитьКоманду(""".\1cv8st.exe"" CONFIG /F "+ПолеВвода2.Текст);
    Иначе
        Команда.УстановитьКоманду(""".\1cv8s.exe"" CONFIG /F "+ПолеВвода2.Текст);
    КонецЕсли;
    КодВозврата = Команда.Исполнить();
    Сообщить(Команда.ПолучитьВывод());
    Если КодВозврата = 0 Тогда
        Сообщить("Конфигуратор успешно запущен");
    Иначе
        Сообщить("Ошибка при запуске конфигуратора");
    КонецЕсли;
КонецФункции

Функция ВыбратьКП()Экспорт

    //Диалог выбора каталога публикации
    Результат = ДиалогВыбораКаталога1.ПоказатьДиалог();
    Если Результат = Ф.РезультатДиалога.ОК  Тогда
	    путь= ДиалогВыбораКаталога1.ВыбранныйПуть;
        Сообщить("Каталог успешно выбран");
    Иначе
        Сообщить("Ошибка выбора каталога!");
    КонецЕсли;
    ПолеВвода3.Текст=""""+путь+"""";
КонецФункции

Процедура Форма1_ПриЗакрытии() Экспорт
    
    //Удаляем старый конфиг
    Команда = Новый Команда;
    Команда.УстановитьСтрокуЗапуска("del /f .\1CPublisherConfig.txt");
    КодВозврата = Команда.Исполнить();
    Если КодВозврата <> 0 Тогда
        Сообщить("Не удалось удалить старый конфиг");
        Сообщить(Команда.ПолучитьВывод());
    КонецЕсли;
    
    //Копируем данные с формы в конфиг
    Команда = Новый Команда;
    Команда.УстановитьКоманду("echo");
    Команда.ДобавитьПараметр("Name: "+ПолеВвода1.Текст+"> .\1CPublisherConfig.txt");
    Команда.Исполнить();
    Сообщить(Команда.ПолучитьВывод());

    Команда = Новый Команда;
    Команда.УстановитьКоманду("echo");
    Команда.ДобавитьПараметр("IbPath: "+ПолеВвода2.Текст+">> .\1CPublisherConfig.txt");
    Команда.Исполнить();
    Сообщить(Команда.ПолучитьВывод());

    Команда = Новый Команда;
    Команда.УстановитьКоманду("echo");
    Команда.ДобавитьПараметр("PublishCatalogPath: "+ПолеВвода3.Текст+">> .\1CPublisherConfig.txt");
    Команда.Исполнить();
    Сообщить(Команда.ПолучитьВывод());

    Команда = Новый Команда;
    Команда.УстановитьКоманду("echo");
    Команда.ДобавитьПараметр("Publish: "+ПолеВвода4.Текст+">> .\1CPublisherConfig.txt");
    Команда.Исполнить();
    Сообщить(Команда.ПолучитьВывод());

    Команда = Новый Команда;
    Команда.УстановитьКоманду("echo");
    Команда.ДобавитьПараметр("Port: "+ПолеВвода5.Текст+">> .\1CPublisherConfig.txt");
    Команда.Исполнить();
    Сообщить(Команда.ПолучитьВывод());

    Команда = Новый Команда;
    Команда.УстановитьКоманду("echo");
    Команда.ДобавитьПараметр("IsLearn: "+Флажок1.Помечен+">> .\1CPublisherConfig.txt");
    Команда.Исполнить();
    Сообщить(Команда.ПолучитьВывод());
КонецПроцедуры

Процедура ЗаполнениеПолей()

    //Получение данных из конфига
    Команда = Новый Команда;
    Команда.УстановитьСтрокуЗапуска("find .\1CPublisherConfig.txt ""Name: """);
    Команда.Исполнить();
    Вывод=СтрПолучитьСтроку(Команда.ПолучитьВывод(),2);
    Результат = СтрЗаменить(Вывод, "Name: ", "");
    ПолеВвода1.Текст=Результат;

    Команда1 = Новый Команда;
    Команда1.УстановитьСтрокуЗапуска("find .\1CPublisherConfig.txt ""IbPath: """);
    Команда1.Исполнить();
    Вывод=СтрПолучитьСтроку(Команда1.ПолучитьВывод(),2);
    Результат = СтрЗаменить(Вывод, "IbPath: ", "");
    ПолеВвода2.Текст=Результат;

    Команда2 = Новый Команда;
    Команда2.УстановитьСтрокуЗапуска("find .\1CPublisherConfig.txt ""PublishCatalogPath: """);
    Команда2.Исполнить();
    Вывод=СтрПолучитьСтроку(Команда2.ПолучитьВывод(),2);
    Результат = СтрЗаменить(Вывод, "PublishCatalogPath: ", "");
    ПолеВвода3.Текст=Результат;

    Команда3 = Новый Команда;
    Команда3.УстановитьСтрокуЗапуска("find .\1CPublisherConfig.txt ""Publish: """);
    Команда3.Исполнить();
    Вывод=СтрПолучитьСтроку(Команда3.ПолучитьВывод(),2);
    Результат = СтрЗаменить(Вывод, "Publish: ", "");
    ПолеВвода4.Текст=Результат;

    Команда4 = Новый Команда;
    Команда4.УстановитьСтрокуЗапуска("find .\1CPublisherConfig.txt ""Port: """);
    Команда4.Исполнить();
    Вывод=СтрПолучитьСтроку(Команда4.ПолучитьВывод(),2);
    Результат = СтрЗаменить(Вывод, "Port: ", "");
    ПолеВвода5.Текст=Результат;

    Команда4 = Новый Команда;
    Команда4.УстановитьСтрокуЗапуска("find .\1CPublisherConfig.txt ""IsLearn: """);
    Команда4.Исполнить();
    Вывод=СтрПолучитьСтроку(Команда4.ПолучитьВывод(),2);
    Результат = СтрЗаменить(Вывод, "IsLearn: ", "");
    
    Если Результат = "Да" Тогда
        Флажок1.Помечен = 1;
    Иначе
        Флажок1.Помечен = 0;
    КонецЕсли;
КонецПроцедуры

Процедура Форма1_ПриОткрытии()
    ЗаполнениеПолей();
КонецПроцедуры

Процедура ПодготовкаКомпонентов()

    #Область созданиеФормы

    ПодключитьВнешнююКомпоненту(".\OneScriptForms.dll");
    Ф = Новый ФормыДляОдноСкрипта();
    Ф.ВключитьВизуальныеСтили();

    Форма_1 = Ф.Форма();
    Форма_1.Отображать = Истина;
    Форма_1.Показать();
    Форма_1.Активизировать();
    Форма_1.ПриЗакрытии=Ф.Действие(ЭтотОбъект, "Форма1_ПриЗакрытии");

    Надпись1 = Ф.Надпись();
    Надпись2 = Ф.Надпись();
    Надпись3 = Ф.Надпись();
    Надпись4 = Ф.Надпись();
    Надпись5 = Ф.Надпись();
    ПолеВвода1 = Ф.ПолеВвода();
    ПолеВвода2 = Ф.ПолеВвода();
    ПолеВвода3 = Ф.ПолеВвода();
    ПолеВвода4 = Ф.ПолеВвода();
    ПолеВвода5 = Ф.ПолеВвода();
    Кнопка1 = Ф.Кнопка();
    Кнопка2 = Ф.Кнопка();
    Кнопка3 = Ф.Кнопка();
    Кнопка4 = Ф.Кнопка();
    Кнопка5 = Ф.Кнопка();
    Кнопка6 = Ф.Кнопка();
    Кнопка7 = Ф.Кнопка();
    Флажок1 = Ф.Флажок();
    ДиалогВыбораКаталога1 = Ф.ДиалогВыбораКаталога();

    Форма_1.Размер = Ф.Размер(1000, 425);
    Форма_1.Значок = Ф.Значок(".\1CPublisherIco.ico");
    Форма_1.Текст = "1С Публикатор";
    Форма_1.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    Надпись1.Родитель = Форма_1;
    Надпись1.Размер = Ф.Размер(205, 25);
    Надпись1.ПорядокОбхода = 4;
    Надпись1.Положение = Ф.Точка(25, 25);
    Надпись1.Текст = "Название базы данных:";
    Надпись1.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    Надпись2.Родитель = Форма_1;
    Надпись2.Размер = Ф.Размер(205, 25);
    Надпись2.ПорядокОбхода = 4;
    Надпись2.Положение = Ф.Точка(25, 75);
    Надпись2.Текст = "Путь к базе данных:";
    Надпись2.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    Надпись3.Родитель = Форма_1;
    Надпись3.Размер = Ф.Размер(205, 25);
    Надпись3.ПорядокОбхода = 4;
    Надпись3.Положение = Ф.Точка(25, 125);
    Надпись3.Текст = "Каталог публикации:";
    Надпись3.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    Надпись4.Родитель = Форма_1;
    Надпись4.Размер = Ф.Размер(205, 25);
    Надпись4.ПорядокОбхода = 4;
    Надпись4.Положение = Ф.Точка(25, 175);
    Надпись4.Текст = "Имя публикации:";
    Надпись4.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    Надпись5.Родитель = Форма_1;
    Надпись5.Размер = Ф.Размер(205, 25);
    Надпись5.ПорядокОбхода = 4;
    Надпись5.Положение = Ф.Точка(25, 225);
    Надпись5.Текст = "Номер порта:";
    Надпись5.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    ПолеВвода1.Родитель = Форма_1;
    ПолеВвода1.Размер = Ф.Размер(400, 29);
    ПолеВвода1.ПорядокОбхода = 5;
    ПолеВвода1.Положение = Ф.Точка(250, 20);
    ПолеВвода1.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    ПолеВвода2.Родитель = Форма_1;
    ПолеВвода2.Размер = Ф.Размер(400, 29);
    ПолеВвода2.ПорядокОбхода = 5;
    ПолеВвода2.Положение = Ф.Точка(250, 70);
    ПолеВвода2.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    ПолеВвода3.Родитель = Форма_1;
    ПолеВвода3.Размер = Ф.Размер(400, 29);
    ПолеВвода3.ПорядокОбхода = 5;
    ПолеВвода3.Положение = Ф.Точка(250, 120);
    ПолеВвода3.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    ПолеВвода4.Родитель = Форма_1;
    ПолеВвода4.Размер = Ф.Размер(400, 29);
    ПолеВвода4.ПорядокОбхода = 5;
    ПолеВвода4.Положение = Ф.Точка(250, 170);
    ПолеВвода4.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    ПолеВвода5.Родитель = Форма_1;
    ПолеВвода5.Размер = Ф.Размер(175, 29);
    ПолеВвода5.ПорядокОбхода = 5;
    ПолеВвода5.Положение = Ф.Точка(250, 220);
    ПолеВвода5.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    Кнопка1.Родитель = Форма_1;
    Кнопка1.Размер = Ф.Размер(260, 29);
    Кнопка1.ПорядокОбхода = 6;
    Кнопка1.Положение = Ф.Точка(700, 20);
    Кнопка1.Текст = "Создать новую базу";
    Кнопка1.Шрифт = Ф.Шрифт("Times New Roman", 14, );
	Кнопка1.Нажатие = Ф.Действие(ЭтотОбъект, "СоздатьИБ");

    Кнопка2.Родитель = Форма_1;
    Кнопка2.Размер = Ф.Размер(260, 29);
    Кнопка2.ПорядокОбхода = 6;
    Кнопка2.Положение = Ф.Точка(700, 70);
    Кнопка2.Текст = "Выбрать базу";
    Кнопка2.Шрифт = Ф.Шрифт("Times New Roman", 14, );
    Кнопка2.Нажатие = Ф.Действие(ЭтотОбъект, "ВыбратьИБ");

    Кнопка3.Родитель = Форма_1;
    Кнопка3.Размер = Ф.Размер(260, 29);
    Кнопка3.ПорядокОбхода = 6;
    Кнопка3.Положение = Ф.Точка(700, 120);
    Кнопка3.Текст = "Выбрать каталог публикации";
    Кнопка3.Шрифт = Ф.Шрифт("Times New Roman", 14, );
    Кнопка3.Нажатие = Ф.Действие(ЭтотОбъект, "ВыбратьКП");

    Кнопка4.Родитель = Форма_1;
    Кнопка4.Размер = Ф.Размер(260, 29);
    Кнопка4.ПорядокОбхода = 6;
    Кнопка4.Положение = Ф.Точка(700, 170);
    Кнопка4.Текст = "Запустить веб сервер";
    Кнопка4.Шрифт = Ф.Шрифт("Times New Roman", 14, );
    Кнопка4.Нажатие = Ф.Действие(ЭтотОбъект, "ХостВеба");

    Кнопка5.Родитель = Форма_1;
    Кнопка5.Размер = Ф.Размер(175, 29);
    Кнопка5.ПорядокОбхода = 6;
    Кнопка5.Положение = Ф.Точка(475, 220);
    Кнопка5.Текст = "Изменить порт";
    Кнопка5.Шрифт = Ф.Шрифт("Times New Roman", 14, );
    Кнопка5.Нажатие = Ф.Действие(ЭтотОбъект, "ИзменитьПорт");

    Кнопка6.Родитель = Форма_1;
    Кнопка6.Размер = Ф.Размер(260, 29);
    Кнопка6.ПорядокОбхода = 6;
    Кнопка6.Положение = Ф.Точка(700, 220);
    Кнопка6.Текст = "Запустить конфигуратор";
    Кнопка6.Шрифт = Ф.Шрифт("Times New Roman", 14, );
    Кнопка6.Нажатие = Ф.Действие(ЭтотОбъект, "ЗапуститьКонфигуратор");

    Кнопка7.Родитель = Форма_1;
    Кнопка7.Размер = Ф.Размер(150, 29);
    Кнопка7.ПорядокОбхода = 6;
    Кнопка7.Положение = Ф.Точка(25, 325);
    Кнопка7.Текст = "Найти апач";
    Кнопка7.Шрифт = Ф.Шрифт("Times New Roman", 14, );
    Кнопка7.Нажатие = Ф.Действие(ЭтотОбъект, "НайтиАпач");

    Флажок1.Родитель = Форма_1;
    Флажок1.Размер = Ф.Размер(205, 25);
    Флажок1.ПорядокОбхода = 7;
    Флажок1.Положение = Ф.Точка(25, 275);
    Флажок1.Текст = "Учебная версия";
    Флажок1.Шрифт = Ф.Шрифт("Times New Roman", 14, );

    #КонецОбласти
    Форма1_ПриОткрытии();
КонецПроцедуры

ПодготовкаКомпонентов();
Ф.ЗапуститьОбработкуСобытий();